pattern = r'[0-9A-Z]{4}[BE][A-Z]{2}[HSCEMRTLVP][A-Z]{0,5}([1-9][A-Z])?'

type = {
    "B": "Заднее стекло",
    "E": "Принадлежности заднего стекла",
}

color = {
    "BL": "Голубое",
    "CL": "Прозрачное",
    "GN": "Зеленое",
    "GY": "Серое",
}

body_type = {
    "H": "Хэтчбек",
    "E": "Универсал",
    "R": "Внедорожник",
}

characteristic = {
    "A": "Антенна",
    "G": "GPS антенна",
    "K": "Триплекс",
    "U": "Без обогрева",
}

modification = {
    ("1A", "2A", "3A", "4A", "5A"): "Изменение толщины",
    ("6A", "7A", "8A", "9A"): "Изменение изгиба",
    ("1E", "2E", "3E", "4E", "5E"): "Изменение электрообогрева",
    ("6E", "7E", "8E", "9E"): "Комплект, включающий мягкую крышу и задние фонари",
    ("1N", "2N", "3N", "4N", "5N"): "Изменение шелкографии + лого спецификации",
}
