pattern = r'[0-9A-Z]{4}[FHLMRT][A-Z]{2}[A-Z][2-6][A-Z]{2}[A-Z]{0,2}([1-9][A-Z])?'

type = {
    "F": "Плоское боковое стекло",
    "L": "Левое боковое стекло",
    "R": "Правое боковое стекло",
}

color = {
    "BL": "Голубое",
    "CL": "Прозрачное",
    "GN": "Зеленое",
    "GY": "Серое",
}

body_type = {
    "H3": "Хэтчбек 3 дв.",
    "H5": "Хэтчбек 5 дв.",
    "S2": "Седан 2 дв.",
    "S4": "Седан 4 дв.",
    "E3": "Универсал 3 дв.",
    "E5": "Универсал 5 дв.",
}

position = {
    "FD": "Передняя дверь опускное",
    "RD": "Задняя дверь опускное",
    "RV": "Задняя форточка",
}

characteristic = {
    "A": "Антенна",
    "G": "GPS антенна",
    "J": "ТВ Антенна",
    "O": "Открывающееся",
    "V": "Окно для VIN",
}

modification = {
    ("1A", "2A", "3A", "4A", "5A"): "Изменение толщины",
    ("1C", "2C", "3C", "4C", "5C"): "Изменение размера и шелкографии",
    ("1D", "2D", "3D", "4D", "5D"): "Изменение инкапсуляции",
    ("1F", "2F", "3F", "4F", "5F"): "Изменение антенны",
    ("6F", "7F", "8F", "9F"): "Изменение антенны и инкапсуляции",
}
