pattern = r'[0-9A-Z]{4}[ACD][A-Z]{2}[A-Z]{0,6}([1-9][A-Z])?'

type = {
    "A": "Лобовое стекло",
    "C": "Альтернативное лобовое стекло",
    "D": "Принадлежности лобового стекла",
}

color = {
    "AB": "Противоударное прозрачное (5 слоев)",
    "BA": "Голубое шумопоглощающее",
    "LG": "Светло-зеленое",
    "YA": "Голубое шумопоглощающее",
}

strip_color = {
    "BL": "Голубая",
    "GN": "Зеленая",
}

characteristic = {
    "A": "Антенна",
    "G": "GPS антенна",
    "P": "Изменение шелкографии для датчиков",
    "V": "Окно для VIN",
}

modification = {
    ("1A", "2A", "3A", "4A", "5A"): "Изменение толщины",
    ("6A", "7A", "8A", "9A"): "Изменение изгиба",
    ("1H", "2H", "3H", "4H", "5H"): "Изменение положения крепежа зеркала",
    ("1M", "2M", "3M", "4M", "5M"): "Эмблема, идентифицирующая безопасность",
    ("1Y", "2Y", "3Y", "4Y", "5Y"): "Незначительные изменения размеров и дополнительного оборудования",
}
